export const ENCRYPTED_TEXT = 'ДВОЁГГНДСЗЦПВТНБНДГЬВЧЩЦПЗГЫОПВМБЮБОВШББЦЗВЦДМБЭВГДНТЦДДЦЫЭДЦЕУМВЩВЗСФГЕВОВМВПЩЬВЪБНДЩАГЩПЦГЦДМБЭБГЦДАЩГЁЗГЫЬЦИГМБЬВЪБНДЩВДЧЩУЙДЦНЩЦОЦЕЧЭГЗБТПЩВЬОВРАБМЦДЗЦЪЦАЩЦГОДВЬУЬЦЁГЬЦЩЪВЗБЖЦПУПВДСНАГШБВМБЖБЩЦПВЗЗЦГПУНФГГЦЕЩВЖЦПВЗБГНЦНЩЦОЦЬЦЕЧЭГЗБТЦДЦИЗЦЪЦИЦДЩЯРМГДЩВЗГГЕУМЮБОНБЩЦПВЗЗУЫНЩЦОИПВЪЦИВОВЁИУЫБЖПЧЖЦПЧЭВНДЗБОЦПАБМЦДЗЦЪЦАЩЦГОДВПУЕЩВМИМТНГЕТЦАДБЬВМСЗЧЛЬЦИГМСОДЦДЦЖВТПБМОЗВЕЦЩЧЪЦИЦПУГЬВЪБНДЩВДЧЩУЧЗВНЗВАЩБЬГЩГНДСДВОЦЫЦАУДПДЦЩЦГЦДМБЭБГПОВЭГНДПГЦЕЩВЖЦПВДГМСЗЦЪЦЩГЖЧМСДВДВПУАЧНОЗБОЗГАЩЦНДЦЬВЪБНДЩАЦЗВАЩВПМГЗБЛАЦИЪЦДЦПОБЬУЮБОНБЩЧГЬЭГДОЧЛОПВМБЮБОВШБЛОЦДЦЩВТАЩБЕМБЁГЗВОАЩЦЮГННБЦЗВМСЗУЬНДВЗИВЩДВЬБЪМВПЗЦГДЩГЕЦПВЗБТЬЩУЗОВДЩЧИВЗВАЩБЬГЩРБЬБОВЗВМБДБО';

// Частотность букв русского алфавита
export const russianFrequencies = [
  // "-",
  "О", "Е", "А", "И", "Н", "Т", "С", "Р", "В", "Л",
  "К", "М", "Д", "П", "У", "Я", "Ы", "Ь", "Г", "З",
  "Б", "Ч", "Й", "Х", "Ж", "Ш", "Ю", "Ц", "Щ", "Э", "Ф", "Ъ", "Ё"
];

export const russianBigrams = [
  "СТ", "НО", "ЕН", "ТО", "НА",
  "ОВ", "НИ", "РА", "ВО", "КО",
  "РО", "ПО", "ГО", "ЕР", "ОС",
  "ВА", "ОТ", "ТЕ", "АЛ", "ЛИ"
];

export const russianTrigrams = [
  "ЕНИ", "ОСТ", "ОГО", "СКО", "СТВ",
  "СТА", "ГОД", "ПРО", "АНИ", "ТОР",
  "ОВА", "ЕСТ", "СКИ", "ОРО", "НИЯ",
  "НИЕ", "ПРИ", "ЕНН", "ПОЛ", "ПЕР",
  "ТЕЛ", "РОВ", "СТИ", "ОДА", "СТО",
  "СТР", "ЕЛЬ", "БЫЛ", "НОВ", "АЛЬ",
  "НОЙ", "ОЛЬ", "АСТ", "ПРЕ", "КОМ",
  "ЧЕС", "ВАН", "ННО", "ЕРЕ", "РЕД",
  "ТСЯ", "ПОС", "НОГ", "ННЫ", "НЫХ",
  "МЕН", "ЕСК", "ОТО", "РАЗ", "ИТЕ",
];

export const russianFrequenciesMap = {
  // "-": 0.175,
  "О": 0.09,
  "Е": 0.072,
  "А": 0.062,
  "И": 0.062,
  "Т": 0.053,
  "Н": 0.053,
  "С": 0.045,
  "Р": 0.04,
  "В": 0.038,
  "Л": 0.035,
  "К": 0.028,
  "М": 0.026,
  "Д": 0.025,
  "П": 0.023,
  "У": 0.021,
  "Я": 0.018,
  "Ы": 0.016,
  "З": 0.016,
  "Ь": 0.014,
  "Б": 0.014,
  "Г": 0.013,
  "Ч": 0.012,
  "Й": 0.01,
  "Х": 0.009,
  "Ж": 0.007,
  "Ю": 0.006,
  "Ш": 0.006,
  "Ц": 0.004,
  "Щ": 0.003,
  "Э": 0.003,
  "Ф": 0.002
}

export const RUSSIAN_TRIGRAMS =  [
  "ени", "ост", "ого", "ска", "про", "ова", "ста", "гос",
  "ани", "ный", "при", "пол", "тер", "ста", "под", "ело",
];